---
kind: type
id: T:Autodesk.Revit.UI.RibbonItem
source: html/79225f03-1633-3722-15b0-752c91a3740d.htm
---
# Autodesk.Revit.UI.RibbonItem

The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down
which should contain the information for creating one RibbonItem.

## Syntax (C#)
```csharp
public class RibbonItem
```

## Remarks
This class is not supported in Revit Macros.